{
  "status": "success",
  "totalResults": 6603,
  "results": [
    {
      "title": "Mona Singh on Laal Singh Chaddha’s box office collection: ‘Don’t think of short term things like money’",
      "link": "https://indianexpress.com/article/entertainment/bollywood/mona-singh-on-laal-singh-chaddhas-box-office-collection-dont-think-of-short-term-things-like-money-aamir-khan-forrest-gump-8099811/",
      "keywords": ["Bollywood", "Entertainment"],
      "creator": null,
      "video_url": null,
      "description": null,
      "content": null,
      "pubDate": "2022-08-19 11:25:20",
      "image_url": null,
      "source_id": "indianexpress",
      "country": ["india"],
      "category": ["entertainment"],
      "language": "english"
    },
    {
      "title": "Tv actress Nupur Alankar quits showbiz & takes sanyas; says 'my husband has freed me'",
      "link": "https://www.indiatvnews.com/entertainment/tv/tv-actress-nupur-alankar-quits-showbiz-takes-sanyas-husband-freed-me-viral-pics-latest-entertainment-news-2022-08-19-801312",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "Tv actress Nupur Alankar who has been a part of the entertainment industry for almost three decades on Thursday left her fans shocked after she announced quitting the industry to follow the path of spirituality. Nupur who has been a popular face in the television industry has taken 'sanyas' from worldly possessions. She has given up on fancy attires and is seen wearing saffron robes as she visits pilgrimage sites. She is now on her way to the Himalayas. ",
      "content": null,
      "pubDate": "2022-08-19 11:21:21",
      "image_url": null,
      "source_id": "indiatvnews",
      "country": ["india"],
      "category": ["entertainment"],
      "language": "english"
    },
    {
      "title": "Aquabots: Ultrasoft liquid robots for biomedical and environmental applications",
      "link": "https://techxplore.com/news/2022-08-aquabots-ultrasoft-liquid-robots-biomedical.html",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "In recent years, roboticists have developed a wide variety of robotic systems with different body structures and capabilities. Most of these robots are either made of hard materials, such as metals, or soft materials, such as silicon and rubbery materials.",
      "content": null,
      "pubDate": "2022-08-19 11:20:01",
      "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2022/aquabots-ultrasoft-liq.jpg",
      "source_id": "phys",
      "country": [
        "united states of america",
        "united kingdom",
        "india",
        "australia",
        "singapore"
      ],
      "category": ["technology"],
      "language": "english"
    },
    {
      "title": "Death Standing joins PC Game Pass soon",
      "link": "https://www.trueachievements.com/n50818/death-stranding-coming-to-pc-game-pass",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "It's official! Death Stranding is coming to PC Game Pass!",
      "content": null,
      "pubDate": "2022-08-19 11:17:14",
      "image_url": "https://www.trueachievements.com/customimages/carousel/131370.jpg",
      "source_id": "trueachievements",
      "country": [
        "united states of america",
        "united kingdom",
        "india",
        "australia",
        "singapore",
        "canada"
      ],
      "category": ["technology"],
      "language": "english"
    },
    {
      "title": "No double for Jacobs as Turkey rain on Italy’s parade",
      "link": "https://sportstar.thehindu.com/athletics/no-double-for-jacobs-as-turkey-rain-on-italy-parade/article65787296.ece",
      "keywords": null,
      "creator": ["\n        AFP  \n    "],
      "video_url": null,
      "description": "Olympic 100m champion Marcell Jacobs’ plans for an European golden double went up in smoke on Friday after the Italian 4x100m relay team failed to make the final.",
      "content": null,
      "pubDate": "2022-08-19 11:15:32",
      "image_url": null,
      "source_id": "sportstar",
      "country": ["india"],
      "category": ["sports"],
      "language": "english"
    },
    {
      "title": "Kanishka Soni on getting hate for marrying herself: 'Technology has progresses, women don’t need men for sex'",
      "link": "https://www.hindustantimes.com/entertainment/tv/kanishka-soni-on-getting-hate-for-marrying-herself-women-don-t-need-men-for-sex-101660904448740.html",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "Kanishka Soni shared photos of herself wearing sindoor and mangalsutra as she announced she had married herself. Now, in a new video, the actor reacted to those questioning her decision, and explained why she did not marry a man.",
      "content": null,
      "pubDate": "2022-08-19 11:15:23",
      "image_url": "https://images.hindustantimes.com/img/2022/08/19/1600x900/kanishka_soni_1660731429771_1660904711258_1660904711258.JPG",
      "source_id": "hindustantimes",
      "country": ["india"],
      "category": ["entertainment"],
      "language": "english"
    },
    {
      "title": "The Morning After: Streaming overtakes cable TV for the first time",
      "link": "https://www.engadget.com/the-morning-after-streaming-overtakes-cable-tv-for-the-first-time-111500221.html?src=rss",
      "keywords": [
        "site|engadget",
        "provider_name|Engadget",
        "region|US",
        "language|en-US",
        "author_name|Mat Smith"
      ],
      "creator": null,
      "video_url": null,
      "description": "Did you know streaming TV was the future? Nielsen data shows streaming TV viewership in the US surpassed cable for the first time this July. About 34.8 percent of viewing time went to shows on internet services — slightly more than the 34.4 percent for cable.Breaking it down further, Netflix had the largest share (8 percent) thanks largely to demand for Stranger Things 4. Hulu also claimed a record 3.6 percent; Amazon Prime Video picked up 3 percent. YouTube and YouTube TV earned a combined 7.3 percent, but no presence in these figures for Disney+.The next challenge? Streams haven't yet overtaken traditional TV — broadcasts still represented 21.6 percent according to those July figures. Shouldn’t take too long: Netflix just released a documentary about cats. Broadcast doesn’t stand a chance.— Mat SmithThe biggest stories you might have missed‘Diablo IV’ won’t include pay-to-win microtransactionsAcura shows off a Precision EV concept inspired by Italian power boats Snap reportedly gives up on its selfie drone just four months after its debut Cameo now lets you buy 10-minute video calls with celebritiesHBO Max is removing 36 shows ahead of Discovery+ mergerNexus Mods bans 'Spider-Man Remastered' patch that replaced in-game Pride flagsEmbracer snaps up the rights to 'The Lord of the Rings' and 'The Hobbit'Motorola Edge hands-on: A return to (midrange) form?The company might finally be responding to customer feedback.EngadgetMotorolo’s new Edge 2022 (not to be confused with the Edge+ from earlier this year) has a big 6.6-inch OLED screen featuring a 144Hz refresh rate, similar to its more expensive sibling, along with a sizable 5,000 mAh battery, 6GB or 8GB of RAM and up to 256GB of storage. As for its cameras, you also get a familiar 50-megapixel main sensor paired with a lower-res 13MP ultra-wide cam (which can also shoot macros) and a depth sensor to help with portrait-style shots. Between its specs and that $500 launch price, the Edge is looking particularly intriguing.Continue reading.Dodge says its all-electric Charger concept is as loud as gas-powered muscle carsIts EV has an exhaust that emits sounds.DodgeWhen Dodge CEO Tim Kuniskis first talked about releasing an \"American eMuscle\" car last year, he said the company's vehicle will \"tear up the streets, not the planet.\" Now, the company has revealed the Dodge Charger Daytona SRT concept, which looks like a futuristic take on its gas-powered Challenger and Charger muscle cars.Unlike other electric vehicles that barely make a sound, the all-electric Charger is loud, just like its gas-powered counterparts. The company put an exhaust on the vehicle, even though it doesn't need one and the only thing it emits is sound. \"The Charger Daytona SRT Concept voices a 126 dB roar that equals the SRT Hellcat,\" Dodge wrote in its announcement.Continue reading.GeForce Now boosts Chrome streaming to 120 fps and 1440pBut you'll need an RTX 3080 membership to access the new settings.NVIDIA is adding a new perk to GeForce Now’s most expensive tier. Starting today, you can stream games at 1440p and 120 frames per second through a browser. The new performance setting is available exclusively through GeForce Now’s $20 per month RTX 3080 membership and only Google Chrome on PC. Remember: You might need a compatible display to do it justice.Continue reading.HBO Max is offering a 30 percent discount on its annual plansGiven how much content the service is removing and canceling.You get 30 percent off HBO Max’s streaming service if you sign up for a year (over 40 percent compared with a monthly plan). If you don't mind dealing with ads, the service will cost $70 for 12 months, down from the usual $100. HBO Max is introducing the offer just days before the Game of Thrones spin-off show House of the Dragon premieres. However, Warner Bros. Discovery has been culling content and canceling high-profile original movies as part of a major cost-cutting drive.​​Continue reading.The best study-from-home essentials for studentsThese tools may actually make you want to hit the books.Sure, we might recommend laptops, but that’s just the start. You might want to consider a laptop stand for preventing neck and arm pain, or a pair of noise-canceling headphones for blocking out distractions. From an external keyboard to a USB dock, we have suggestions on how to improve those long study sessions.Continue reading.",
      "content": null,
      "pubDate": "2022-08-19 11:15:00",
      "image_url": null,
      "source_id": "engadget",
      "country": [
        "united states of america",
        "united kingdom",
        "india",
        "singapore"
      ],
      "category": ["technology"],
      "language": "english"
    },
    {
      "title": "Manisha Kalyan creates history, becomes first Indian footballer to play in UEFA Champions League",
      "link": "https://www.indiatvnews.com/sports/football/manisha-kalyan-creates-history-becomes-first-indian-footballer-to-play-in-uefa-champions-league-latest-news-latest-updates-uefa-2022-08-19-801308",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "Manisha Kalyan: In a proud act of creating history, Manisha Kalyan has become the first Indian footballer to debut at the UEFA Champions League. She debuted for Apollon Ladies FC on Thursday. She was substituted in the 60th minute in the qualifying match as she replaced Marilena Georgiou of Cyprus at the Makareio Stadium. Apollon Ladies FC later went on to beat Latvian top flight club SFK Riga 3-0. Now Apollon Ladies FC is all set to take on Zurich Frauen on August 21, 2022.",
      "content": null,
      "pubDate": "2022-08-19 11:14:09",
      "image_url": null,
      "source_id": "indiatvnews",
      "country": ["india"],
      "category": ["sports"],
      "language": "english"
    },
    {
      "title": "Manchester United to sign Casemiro: 'Go to doctor', here's how fans have trolled transfer news of Real Madrid star",
      "link": "https://zeenews.india.com/football/manchester-united-to-sign-casemiro-go-to-doctor-heres-how-fans-have-trolled-transfer-news-of-real-madrid-star-2499131.html",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "As Manchester United inch closer to sign Real Madrid star Casemiro, fans are trolling the club, check reactions here",
      "content": null,
      "pubDate": "2022-08-19 11:14:00",
      "image_url": null,
      "source_id": "zeenews",
      "country": ["india"],
      "category": ["sports"],
      "language": "english"
    },
    {
      "title": "Bhaichung Bhutia in race to become AIFF president's post, Kalyan Chaubey front runner for job",
      "link": "https://zeenews.india.com/football/bhaichung-bhutia-in-race-to-become-aiff-presidents-post-kalyan-chaubey-front-runner-for-job-2499129.html",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "The legendary Bhaichung Bhutia on Friday filed his nomination for the president's post in the upcoming All India Football Federation (AIFF) elections even as former player Kalyan Chaubey has emerged as the front runner in the race for the top job. Former captain Bhutia was proposed by his onetime national teammate Deepak Mondal and seconded by Madhu Kumari. Kumari is part of the electoral college as an 'eminent' player.",
      "content": null,
      "pubDate": "2022-08-19 11:12:00",
      "image_url": null,
      "source_id": "zeenews",
      "country": ["india"],
      "category": ["sports"],
      "language": "english"
    }
  ],
  "nextPage": 1
}
